evidence/OPS-2204/after/k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2204.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * nightly_export: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 264 complete and 0 interrupted iterations
nightly_export   [   1% ] 50 VUs  0m01.0s/2m0s

running (0m02.0s), 50/50 VUs, 502 complete and 0 interrupted iterations
nightly_export   [   2% ] 50 VUs  0m02.0s/2m0s

running (0m03.0s), 50/50 VUs, 784 complete and 0 interrupted iterations
nightly_export   [   2% ] 50 VUs  0m03.0s/2m0s

running (0m04.0s), 50/50 VUs, 1103 complete and 0 interrupted iterations
nightly_export   [   3% ] 50 VUs  0m04.0s/2m0s

running (0m05.0s), 50/50 VUs, 1428 complete and 0 interrupted iterations
nightly_export   [   4% ] 50 VUs  0m05.0s/2m0s

running (0m06.0s), 50/50 VUs, 1755 complete and 0 interrupted iterations
nightly_export   [   5% ] 50 VUs  0m06.0s/2m0s

running (0m07.0s), 50/50 VUs, 2089 complete and 0 interrupted iterations
nightly_export   [   6% ] 50 VUs  0m07.0s/2m0s

running (0m08.0s), 50/50 VUs, 2402 complete and 0 interrupted iterations
nightly_export   [   7% ] 50 VUs  0m08.0s/2m0s

running (0m09.0s), 50/50 VUs, 2729 complete and 0 interrupted iterations
nightly_export   [   7% ] 50 VUs  0m09.0s/2m0s

running (0m10.0s), 50/50 VUs, 3068 complete and 0 interrupted iterations
nightly_export   [   8% ] 50 VUs  0m10.0s/2m0s

running (0m11.0s), 50/50 VUs, 3396 complete and 0 interrupted iterations
nightly_export   [   9% ] 50 VUs  0m11.0s/2m0s

running (0m12.0s), 50/50 VUs, 3725 complete and 0 interrupted iterations
nightly_export   [  10% ] 50 VUs  0m12.0s/2m0s

running (0m13.0s), 50/50 VUs, 4051 complete and 0 interrupted iterations
nightly_export   [  11% ] 50 VUs  0m13.0s/2m0s

running (0m14.0s), 50/50 VUs, 4383 complete and 0 interrupted iterations
nightly_export   [  12% ] 50 VUs  0m14.0s/2m0s

running (0m15.0s), 50/50 VUs, 4706 complete and 0 interrupted iterations
nightly_export   [  12% ] 50 VUs  0m15.0s/2m0s

running (0m16.0s), 50/50 VUs, 5026 complete and 0 interrupted iterations
nightly_export   [  13% ] 50 VUs  0m16.0s/2m0s

running (0m17.0s), 50/50 VUs, 5354 complete and 0 interrupted iterations
nightly_export   [  14% ] 50 VUs  0m17.0s/2m0s

running (0m18.0s), 50/50 VUs, 5678 complete and 0 interrupted iterations
nightly_export   [  15% ] 50 VUs  0m18.0s/2m0s

running (0m19.0s), 50/50 VUs, 6008 complete and 0 interrupted iterations
nightly_export   [  16% ] 50 VUs  0m19.0s/2m0s

running (0m20.0s), 50/50 VUs, 6340 complete and 0 interrupted iterations
nightly_export   [  17% ] 50 VUs  0m20.0s/2m0s

running (0m21.0s), 50/50 VUs, 6664 complete and 0 interrupted iterations
nightly_export   [  17% ] 50 VUs  0m21.0s/2m0s

running (0m22.0s), 50/50 VUs, 6969 complete and 0 interrupted iterations
nightly_export   [  18% ] 50 VUs  0m22.0s/2m0s

running (0m23.0s), 50/50 VUs, 7290 complete and 0 interrupted iterations
nightly_export   [  19% ] 50 VUs  0m23.0s/2m0s

running (0m24.0s), 50/50 VUs, 7623 complete and 0 interrupted iterations
nightly_export   [  20% ] 50 VUs  0m24.0s/2m0s

running (0m25.0s), 50/50 VUs, 7951 complete and 0 interrupted iterations
nightly_export   [  21% ] 50 VUs  0m25.0s/2m0s

running (0m26.0s), 50/50 VUs, 8201 complete and 0 interrupted iterations
nightly_export   [  22% ] 50 VUs  0m26.0s/2m0s

running (0m27.0s), 50/50 VUs, 8509 complete and 0 interrupted iterations
nightly_export   [  22% ] 50 VUs  0m27.0s/2m0s

running (0m28.0s), 50/50 VUs, 8826 complete and 0 interrupted iterations
nightly_export   [  23% ] 50 VUs  0m28.0s/2m0s

running (0m29.0s), 50/50 VUs, 9154 complete and 0 interrupted iterations
nightly_export   [  24% ] 50 VUs  0m29.0s/2m0s

running (0m30.0s), 50/50 VUs, 9449 complete and 0 interrupted iterations
nightly_export   [  25% ] 50 VUs  0m30.0s/2m0s

running (0m31.0s), 50/50 VUs, 9767 complete and 0 interrupted iterations
nightly_export   [  26% ] 50 VUs  0m31.0s/2m0s

running (0m32.0s), 50/50 VUs, 10115 complete and 0 interrupted iterations
nightly_export   [  27% ] 50 VUs  0m32.0s/2m0s

running (0m33.0s), 50/50 VUs, 10452 complete and 0 interrupted iterations
nightly_export   [  27% ] 50 VUs  0m33.0s/2m0s

running (0m34.0s), 50/50 VUs, 10798 complete and 0 interrupted iterations
nightly_export   [  28% ] 50 VUs  0m34.0s/2m0s

running (0m35.0s), 50/50 VUs, 11142 complete and 0 interrupted iterations
nightly_export   [  29% ] 50 VUs  0m35.0s/2m0s

running (0m36.0s), 50/50 VUs, 11475 complete and 0 interrupted iterations
nightly_export   [  30% ] 50 VUs  0m36.0s/2m0s

running (0m37.0s), 50/50 VUs, 11669 complete and 0 interrupted iterations
nightly_export   [  31% ] 50 VUs  0m37.0s/2m0s

running (0m38.0s), 50/50 VUs, 11937 complete and 0 interrupted iterations
nightly_export   [  32% ] 50 VUs  0m38.0s/2m0s

running (0m39.0s), 50/50 VUs, 12205 complete and 0 interrupted iterations
nightly_export   [  32% ] 50 VUs  0m39.0s/2m0s

running (0m40.0s), 50/50 VUs, 12524 complete and 0 interrupted iterations
nightly_export   [  33% ] 50 VUs  0m40.0s/2m0s

running (0m41.0s), 50/50 VUs, 12851 complete and 0 interrupted iterations
nightly_export   [  34% ] 50 VUs  0m41.0s/2m0s

running (0m42.0s), 50/50 VUs, 13192 complete and 0 interrupted iterations
nightly_export   [  35% ] 50 VUs  0m42.0s/2m0s

running (0m43.0s), 50/50 VUs, 13521 complete and 0 interrupted iterations
nightly_export   [  36% ] 50 VUs  0m43.0s/2m0s

running (0m44.0s), 50/50 VUs, 13846 complete and 0 interrupted iterations
nightly_export   [  37% ] 50 VUs  0m44.0s/2m0s

running (0m45.0s), 50/50 VUs, 14166 complete and 0 interrupted iterations
nightly_export   [  37% ] 50 VUs  0m45.0s/2m0s

running (0m46.0s), 50/50 VUs, 14458 complete and 0 interrupted iterations
nightly_export   [  38% ] 50 VUs  0m46.0s/2m0s

running (0m47.0s), 50/50 VUs, 14803 complete and 0 interrupted iterations
nightly_export   [  39% ] 50 VUs  0m47.0s/2m0s

running (0m48.0s), 50/50 VUs, 15121 complete and 0 interrupted iterations
nightly_export   [  40% ] 50 VUs  0m48.0s/2m0s

running (0m49.0s), 50/50 VUs, 15456 complete and 0 interrupted iterations
nightly_export   [  41% ] 50 VUs  0m49.0s/2m0s

running (0m50.0s), 50/50 VUs, 15795 complete and 0 interrupted iterations
nightly_export   [  42% ] 50 VUs  0m50.0s/2m0s

running (0m51.0s), 50/50 VUs, 16126 complete and 0 interrupted iterations
nightly_export   [  42% ] 50 VUs  0m51.0s/2m0s

running (0m52.0s), 50/50 VUs, 16466 complete and 0 interrupted iterations
nightly_export   [  43% ] 50 VUs  0m52.0s/2m0s

running (0m53.0s), 50/50 VUs, 16803 complete and 0 interrupted iterations
nightly_export   [  44% ] 50 VUs  0m53.0s/2m0s

running (0m54.0s), 50/50 VUs, 17149 complete and 0 interrupted iterations
nightly_export   [  45% ] 50 VUs  0m54.0s/2m0s

running (0m55.0s), 50/50 VUs, 17475 complete and 0 interrupted iterations
nightly_export   [  46% ] 50 VUs  0m55.0s/2m0s

running (0m56.0s), 50/50 VUs, 17828 complete and 0 interrupted iterations
nightly_export   [  47% ] 50 VUs  0m56.0s/2m0s

running (0m57.0s), 50/50 VUs, 18163 complete and 0 interrupted iterations
nightly_export   [  47% ] 50 VUs  0m57.0s/2m0s

running (0m58.0s), 50/50 VUs, 18500 complete and 0 interrupted iterations
nightly_export   [  48% ] 50 VUs  0m58.0s/2m0s

running (0m59.0s), 50/50 VUs, 18827 complete and 0 interrupted iterations
nightly_export   [  49% ] 50 VUs  0m59.0s/2m0s

running (1m00.0s), 50/50 VUs, 19174 complete and 0 interrupted iterations
nightly_export   [  50% ] 50 VUs  1m00.0s/2m0s

running (1m01.0s), 50/50 VUs, 19479 complete and 0 interrupted iterations
nightly_export   [  51% ] 50 VUs  1m01.0s/2m0s

running (1m02.0s), 50/50 VUs, 19818 complete and 0 interrupted iterations
nightly_export   [  52% ] 50 VUs  1m02.0s/2m0s

running (1m03.0s), 50/50 VUs, 20166 complete and 0 interrupted iterations
nightly_export   [  52% ] 50 VUs  1m03.0s/2m0s

running (1m04.0s), 50/50 VUs, 20495 complete and 0 interrupted iterations
nightly_export   [  53% ] 50 VUs  1m04.0s/2m0s

running (1m05.0s), 50/50 VUs, 20840 complete and 0 interrupted iterations
nightly_export   [  54% ] 50 VUs  1m05.0s/2m0s

running (1m06.0s), 50/50 VUs, 21156 complete and 0 interrupted iterations
nightly_export   [  55% ] 50 VUs  1m06.0s/2m0s

running (1m07.0s), 50/50 VUs, 21475 complete and 0 interrupted iterations
nightly_export   [  56% ] 50 VUs  1m07.0s/2m0s

running (1m08.0s), 50/50 VUs, 21746 complete and 0 interrupted iterations
nightly_export   [  57% ] 50 VUs  1m08.0s/2m0s

running (1m09.0s), 50/50 VUs, 22079 complete and 0 interrupted iterations
nightly_export   [  57% ] 50 VUs  1m09.0s/2m0s

running (1m10.0s), 50/50 VUs, 22417 complete and 0 interrupted iterations
nightly_export   [  58% ] 50 VUs  1m10.0s/2m0s

running (1m11.0s), 50/50 VUs, 22766 complete and 0 interrupted iterations
nightly_export   [  59% ] 50 VUs  1m11.0s/2m0s

running (1m12.0s), 50/50 VUs, 23097 complete and 0 interrupted iterations
nightly_export   [  60% ] 50 VUs  1m12.0s/2m0s

running (1m13.0s), 50/50 VUs, 23439 complete and 0 interrupted iterations
nightly_export   [  61% ] 50 VUs  1m13.0s/2m0s

running (1m14.0s), 50/50 VUs, 23693 complete and 0 interrupted iterations
nightly_export   [  62% ] 50 VUs  1m14.0s/2m0s

running (1m15.0s), 50/50 VUs, 24041 complete and 0 interrupted iterations
nightly_export   [  62% ] 50 VUs  1m15.0s/2m0s

running (1m16.0s), 50/50 VUs, 24393 complete and 0 interrupted iterations
nightly_export   [  63% ] 50 VUs  1m16.0s/2m0s

running (1m17.0s), 50/50 VUs, 24740 complete and 0 interrupted iterations
nightly_export   [  64% ] 50 VUs  1m17.0s/2m0s

running (1m18.0s), 50/50 VUs, 25024 complete and 0 interrupted iterations
nightly_export   [  65% ] 50 VUs  1m18.0s/2m0s

running (1m19.0s), 50/50 VUs, 25256 complete and 0 interrupted iterations
nightly_export   [  66% ] 50 VUs  1m19.0s/2m0s

running (1m20.0s), 50/50 VUs, 25530 complete and 0 interrupted iterations
nightly_export   [  67% ] 50 VUs  1m20.0s/2m0s

running (1m21.0s), 50/50 VUs, 25824 complete and 0 interrupted iterations
nightly_export   [  67% ] 50 VUs  1m21.0s/2m0s

running (1m22.0s), 50/50 VUs, 26129 complete and 0 interrupted iterations
nightly_export   [  68% ] 50 VUs  1m22.0s/2m0s

running (1m23.0s), 50/50 VUs, 26426 complete and 0 interrupted iterations
nightly_export   [  69% ] 50 VUs  1m23.0s/2m0s

running (1m24.0s), 50/50 VUs, 26786 complete and 0 interrupted iterations
nightly_export   [  70% ] 50 VUs  1m24.0s/2m0s

running (1m25.0s), 50/50 VUs, 27144 complete and 0 interrupted iterations
nightly_export   [  71% ] 50 VUs  1m25.0s/2m0s

running (1m26.0s), 50/50 VUs, 27495 complete and 0 interrupted iterations
nightly_export   [  72% ] 50 VUs  1m26.0s/2m0s

running (1m27.0s), 50/50 VUs, 27832 complete and 0 interrupted iterations
nightly_export   [  72% ] 50 VUs  1m27.0s/2m0s

running (1m28.0s), 50/50 VUs, 28080 complete and 0 interrupted iterations
nightly_export   [  73% ] 50 VUs  1m28.0s/2m0s

running (1m29.0s), 50/50 VUs, 28378 complete and 0 interrupted iterations
nightly_export   [  74% ] 50 VUs  1m29.0s/2m0s

running (1m30.0s), 50/50 VUs, 28627 complete and 0 interrupted iterations
nightly_export   [  75% ] 50 VUs  1m30.0s/2m0s

running (1m31.0s), 50/50 VUs, 28925 complete and 0 interrupted iterations
nightly_export   [  76% ] 50 VUs  1m31.0s/2m0s

running (1m32.0s), 50/50 VUs, 29257 complete and 0 interrupted iterations
nightly_export   [  77% ] 50 VUs  1m32.0s/2m0s

running (1m33.0s), 50/50 VUs, 29601 complete and 0 interrupted iterations
nightly_export   [  77% ] 50 VUs  1m33.0s/2m0s

running (1m34.0s), 50/50 VUs, 29916 complete and 0 interrupted iterations
nightly_export   [  78% ] 50 VUs  1m34.0s/2m0s

running (1m35.0s), 50/50 VUs, 30126 complete and 0 interrupted iterations
nightly_export   [  79% ] 50 VUs  1m35.0s/2m0s

running (1m36.0s), 50/50 VUs, 30388 complete and 0 interrupted iterations
nightly_export   [  80% ] 50 VUs  1m36.0s/2m0s

running (1m37.0s), 50/50 VUs, 30451 complete and 0 interrupted iterations
nightly_export   [  81% ] 50 VUs  1m37.0s/2m0s

running (1m38.0s), 50/50 VUs, 30699 complete and 0 interrupted iterations
nightly_export   [  82% ] 50 VUs  1m38.0s/2m0s

running (1m39.0s), 50/50 VUs, 30981 complete and 0 interrupted iterations
nightly_export   [  82% ] 50 VUs  1m39.0s/2m0s

running (1m40.0s), 50/50 VUs, 31295 complete and 0 interrupted iterations
nightly_export   [  83% ] 50 VUs  1m40.0s/2m0s

running (1m41.0s), 50/50 VUs, 31616 complete and 0 interrupted iterations
nightly_export   [  84% ] 50 VUs  1m41.0s/2m0s

running (1m42.0s), 50/50 VUs, 31949 complete and 0 interrupted iterations
nightly_export   [  85% ] 50 VUs  1m42.0s/2m0s

running (1m43.0s), 50/50 VUs, 32265 complete and 0 interrupted iterations
nightly_export   [  86% ] 50 VUs  1m43.0s/2m0s

running (1m44.0s), 50/50 VUs, 32556 complete and 0 interrupted iterations
nightly_export   [  87% ] 50 VUs  1m44.0s/2m0s

running (1m45.0s), 50/50 VUs, 32897 complete and 0 interrupted iterations
nightly_export   [  87% ] 50 VUs  1m45.0s/2m0s

running (1m46.0s), 50/50 VUs, 33229 complete and 0 interrupted iterations
nightly_export   [  88% ] 50 VUs  1m46.0s/2m0s

running (1m47.0s), 50/50 VUs, 33581 complete and 0 interrupted iterations
nightly_export   [  89% ] 50 VUs  1m47.0s/2m0s

running (1m48.0s), 50/50 VUs, 33908 complete and 0 interrupted iterations
nightly_export   [  90% ] 50 VUs  1m48.0s/2m0s

running (1m49.0s), 50/50 VUs, 34162 complete and 0 interrupted iterations
nightly_export   [  91% ] 50 VUs  1m49.0s/2m0s

running (1m50.0s), 50/50 VUs, 34431 complete and 0 interrupted iterations
nightly_export   [  92% ] 50 VUs  1m50.0s/2m0s

running (1m51.0s), 50/50 VUs, 34740 complete and 0 interrupted iterations
nightly_export   [  92% ] 50 VUs  1m51.0s/2m0s

running (1m52.0s), 50/50 VUs, 35090 complete and 0 interrupted iterations
nightly_export   [  93% ] 50 VUs  1m52.0s/2m0s

running (1m53.0s), 50/50 VUs, 35435 complete and 0 interrupted iterations
nightly_export   [  94% ] 50 VUs  1m53.0s/2m0s

running (1m54.0s), 50/50 VUs, 35803 complete and 0 interrupted iterations
nightly_export   [  95% ] 50 VUs  1m54.0s/2m0s

running (1m55.0s), 50/50 VUs, 36153 complete and 0 interrupted iterations
nightly_export   [  96% ] 50 VUs  1m55.0s/2m0s

running (1m56.0s), 50/50 VUs, 36515 complete and 0 interrupted iterations
nightly_export   [  97% ] 50 VUs  1m56.0s/2m0s

running (1m57.0s), 50/50 VUs, 36851 complete and 0 interrupted iterations
nightly_export   [  97% ] 50 VUs  1m57.0s/2m0s

running (1m58.0s), 50/50 VUs, 37193 complete and 0 interrupted iterations
nightly_export   [  98% ] 50 VUs  1m58.0s/2m0s

running (1m59.0s), 50/50 VUs, 37552 complete and 0 interrupted iterations
nightly_export   [  99% ] 50 VUs  1m59.0s/2m0s

running (2m00.0s), 50/50 VUs, 37905 complete and 0 interrupted iterations
nightly_export   [ 100% ] 50 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 37956   315.977966/s
    checks_succeeded...: 100.00% 37956 out of 37956
    checks_failed......: 0.00%   0 out of 37956

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=158.08ms min=7.12ms med=152.3ms  max=2.3s p(90)=206.36ms p(95)=226.75ms
      { expected_response:true }...: avg=158.08ms min=7.12ms med=152.3ms  max=2.3s p(90)=206.36ms p(95)=226.75ms
    http_req_failed................: 0.00%  0 out of 37956
    http_reqs......................: 37956  315.977966/s

    EXECUTION
    iteration_duration.............: avg=158.15ms min=8.93ms med=152.37ms max=2.3s p(90)=206.43ms p(95)=226.8ms 
    iterations.....................: 37956  315.977966/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 6.6 GB 55 MB/s
    data_sent......................: 3.4 MB 28 kB/s



running (2m00.1s), 00/50 VUs, 37956 complete and 0 interrupted iterations
nightly_export ✓ [ 100% ] 50 VUs  2m0s